## 1. Creating a dataframe from an array

In [1]:
import pandas as pd
import numpy as np

### Option 1: creating a dataframe with numpy

In [2]:
data = np.array([[1,2], [2,3], [3,4], [4,5]])
print(data)

[[1 2]
 [2 3]
 [3 4]
 [4 5]]

In [3]:
df = pd.DataFrame(data, index = ['row1', 'row2', 'row3', 'row4'], columns=['col1', 'col2'])
df

      col1  col2
row1     1     2
row2     2     3
row3     3     4
row4     4     5

### Option 2: creating a dataframe from a dictionary

In [4]:
states = ['Lagos', 'Kaduna', ' Oyo', 'Cross River']
population = [25000000, 10000000, 9000000, 4000000]

dict_states = {'States': states, 'population': population}

In [5]:
df_population = pd.DataFrame(dict_states)
df_population

        States  population
0        Lagos    25000000
1       Kaduna    10000000
2          Oyo     9000000
3  Cross River     4000000

### Option 3: Creating a DataFrame from a csv file

In [6]:
df_exams = pd.read_csv('StudentsPerformance.csv')

In [7]:
# show first five rows

df_exams.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

In [8]:
df_exams

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95
996,male,group C,high school,free/reduced,none,62,55,55
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

## 2. Displaying a DataFrame

In [10]:
df_exams.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

In [16]:
df_exams.tail(10)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
990,male,group E,high school,free/reduced,completed,86,81,75
991,female,group B,some high school,standard,completed,65,82,78
992,female,group D,associate's degree,free/reduced,none,55,76,76
993,female,group D,bachelor's degree,free/reduced,none,62,72,74
994,male,group A,high school,standard,none,63,63,62
995,female,group E,master's degree,standard,completed,88,99,95
996,male,group C,high school,free/reduced,none,62,55,55
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

In [19]:
df_exams.shape # shape attribute

(1000, 8)